HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCbs_regdef.h
/** \\brief  Set Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGS_Bits
{
    unsigned int BITNUM:13;                 /**< \brief [12:0] Service Request Bit Number to Set (w) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_CBS_TRIGS_Bits;

/** \\brief  TG Routing for MCDS Control */
typedef struct _Ifx_CBS_TRMC_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int BRKOUT:4;                  /**< \brief [7:4] MCDS break_out to Trigger Line Routing (rw) */
    unsigned int SUSOUT:4;                  /**< \brief [11:8] MCDS suspend_out to Trigger Line Routing (rw) */
    unsigned int reserved_12:8;             /**< \brief \internal Reserved */
    unsigned int BRKIN:4;                   /**< \brief [23:20] Trigger Line to MCDS break_in Routing (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_CBS_TRMC_Bits;

/** \\brief  TG Routing for MCDS Triggers */
typedef struct _Ifx_CBS_TRMT_Bits
{
    unsigned int TG0:4;                     /**< \brief [3:0] MCDS trig_out x to Trigger Line Routing (rw) */
    unsigned int TG1:4;                     /**< \brief [7:4] MCDS trig_out x to Trigger Line Routing (rw) */
    unsigned int TG2:4;                     /**< \brief [11:8] MCDS trig_out x to Trigger Line Routing (rw) */
    unsigned int TG3:4;                     /**< \brief [15:12] MCDS trig_out x to Trigger Line Routing (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CBS_TRMT_Bits;

/** \\brief  TG Routing for Special Signals */
typedef struct _Ifx_CBS_TRSS_Bits
{
    unsigned int TT:4;                      /**< \brief [3:0] Trigger Line to Cerberus’ Triggered Transfer Routing (rw) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int SRC0:4;                    /**< \brief [19:16] Trigger Line to SRCx Interrupt Routing (rw) */
    unsigned int SRC1:4;                    /**< \brief [23:20] Trigger Line to SRCx Interrupt Routing (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_CBS_TRSS_Bits;

/** \\brief  TG Routing for OTGB Bits [15:8] */
typedef struct _Ifx_CBS_TRTGB_H_Bits
{
    unsigned int TG8:4;                     /**< \brief [3:0]  (rw) */
    unsigned int TG9:4;                     /**< \brief [7:4]  (rw) */
    unsigned int TG10:4;                    /**< \brief [11:8]  (rw) */
    unsigned int TG11:4;                    /**< \brief [15:12]  (rw) */
    unsigned int TG12:4;                    /**< \brief [19:16]  (rw) */
    unsigned int TG13:4;                    /**< \brief [23:20]  (rw) */
    unsigned int TG14:4;                    /**< \brief [27:24]  (rw) */
    unsigned int TG15:4;                    /**< \brief [31:28]  (rw) */
} Ifx_CBS_TRTGB_H_Bits;

/** \\brief  TG Routing for OTGB Bits [7:0] */
typedef struct _Ifx_CBS_TRTGB_L_Bits
{
    unsigned int TG0:4;                     /**< \brief [3:0]  (rw) */
    unsigned int TG1:4;                     /**< \brief [7:4]  (rw) */
    unsigned int TG2:4;                     /**< \brief [11:8]  (rw) */
    unsigned int TG3:4;                     /**< \brief [15:12]  (rw) */
    unsigned int TG4:4;                     /**< \brief [19:16]  (rw) */
    unsigned int TG5:4;                     /**< \brief [23:20]  (rw) */
    unsigned int TG6:4;                     /**< \brief [27:24]  (rw) */
    unsigned int TG7:4;                     /**< \brief [31:28]  (rw) */
} Ifx_CBS_TRTGB_L_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_union
 * \{  */

/** \\brief  Communication Mode Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_COMDATA_Bits B;
} Ifx_CBS_COMDATA;

/** \\brief  Internally Controlled Trace Source Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_ICTSA_Bits B;
} Ifx_CBS_ICTSA;

/** \\brief  Internally Controlled Trace Destination Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_ICTTA_Bits B;
} Ifx_CBS_ICTTA;

/** \\brief  Internal Mode Status and Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_INTMOD_Bits B;
} Ifx_CBS_INTMOD;

/** \\brief  IOClient Status and Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_IOSR_Bits B;
} Ifx_CBS_IOSR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_JDPID_Bits B;
} Ifx_CBS_JDPID;

/** \\brief  JTAG Device Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_JTAGID_Bits B;
} Ifx_CBS_JTAGID;

/** \\brief  OSCU Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_OCNTRL_Bits B;
} Ifx_CBS_OCNTRL;

/** \\brief  OCDS Enable Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_OEC_Bits B;
} Ifx_CBS_OEC;

/** \\brief  OCDS Interface Mode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_OIFM_Bits B;
} Ifx_CBS_OIFM;

/** \\brief  OSCU Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_OSTATE_Bits B;
} Ifx_CBS_OSTATE;

/** \\brief  TG Capture for Cores - BRKOUT */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCCB_Bits B;
} Ifx_CBS_TCCB;

