HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCbs_regdef.h
/** \\brief  TG Capture for Cores - HALT */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCCH_Bits B;
} Ifx_CBS_TCCH;

/** \\brief  TG Capture for TG Input Pins */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCIP_Bits B;
} Ifx_CBS_TCIP;

/** \\brief  TG Capture for MCDS */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCM_Bits B;
} Ifx_CBS_TCM;

/** \\brief  TG Capture for OTGB0/1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCTGB_Bits B;
} Ifx_CBS_TCTGB;

/** \\brief  TG Capture for TG Lines */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCTL_Bits B;
} Ifx_CBS_TCTL;

/** \\brief  TG Input Pins Routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TIPR_Bits B;
} Ifx_CBS_TIPR;

/** \\brief  TG Line 1 Suspend Targets */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TL1ST_Bits B;
} Ifx_CBS_TL1ST;

/** \\brief  TG Line Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLC_Bits B;
} Ifx_CBS_TLC;

/** \\brief  TG Line Counter Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCC_Bits B;
} Ifx_CBS_TLCC;

/** \\brief  TG Line Capture and Hold Enable */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCHE_Bits B;
} Ifx_CBS_TLCHE;

/** \\brief  TG Line Capture and Hold Clear */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCHS_Bits B;
} Ifx_CBS_TLCHS;

/** \\brief  TG Line Counter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCV_Bits B;
} Ifx_CBS_TLCV;

/** \\brief  TG Line State */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLS_Bits B;
} Ifx_CBS_TLS;

/** \\brief  TG Line Timer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLT_Bits B;
} Ifx_CBS_TLT;

/** \\brief  TG Lines for Trigger to Host */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLTTH_Bits B;
} Ifx_CBS_TLTTH;

/** \\brief  TG Output Pins Pulse Stretcher */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TOPPS_Bits B;
} Ifx_CBS_TOPPS;

/** \\brief  TG Output Pins Routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TOPR_Bits B;
} Ifx_CBS_TOPR;

/** \\brief  TG Routing for CPU */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRC_Bits B;
} Ifx_CBS_TRC;

/** \\brief  TG Routing Events of CPU */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TREC_Bits B;
} Ifx_CBS_TREC;

/** \\brief  Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIG_Bits B;
} Ifx_CBS_TRIG;

/** \\brief  Clear Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIGC_Bits B;
} Ifx_CBS_TRIGC;

/** \\brief  Set Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIGS_Bits B;
} Ifx_CBS_TRIGS;

/** \\brief  TG Routing for MCDS Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRMC_Bits B;
} Ifx_CBS_TRMC;

/** \\brief  TG Routing for MCDS Triggers */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRMT_Bits B;
} Ifx_CBS_TRMT;

/** \\brief  TG Routing for Special Signals */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRSS_Bits B;
} Ifx_CBS_TRSS;

/** \\brief  TG Routing for OTGB Bits [15:8] */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRTGB_H_Bits B;
} Ifx_CBS_TRTGB_H;

/** \\brief  TG Routing for OTGB Bits [7:0] */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRTGB_L_Bits B;
} Ifx_CBS_TRTGB_L;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  TG Routing for OTGB */
typedef volatile struct _Ifx_CBS_TRTGB
{
    Ifx_CBS_TRTGB_L L;                      /**< \brief 0, TG Routing for OTGB Bits [7:0] */
    Ifx_CBS_TRTGB_H H;                      /**< \brief 4, TG Routing for OTGB Bits [15:8] */
} Ifx_CBS_TRTGB;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  CBS object */
typedef volatile struct _Ifx_CBS
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_CBS_JDPID JDPID;                    /**< \brief 8, Module Identification Register */
    Ifx_CBS_OIFM OIFM;                      /**< \brief C, OCDS Interface Mode Register */
    Ifx_CBS_TIPR TIPR;                      /**< \brief 10, TG Input Pins Routing */
    Ifx_CBS_TOPR TOPR;                      /**< \brief 14, TG Output Pins Routing */
    Ifx_CBS_TOPPS TOPPS;                    /**< \brief 18, TG Output Pins Pulse Stretcher */
    Ifx_CBS_TCIP TCIP;                      /**< \brief 1C, TG Capture for TG Input Pins */
    Ifx_CBS_TRC TRC[3];                     /**< \brief 20, TG Routing for CPU */
    unsigned char reserved_2C[16];          /**< \brief 2C, \internal Reserved */
    Ifx_CBS_TRMC TRMC;                      /**< \brief 3C, TG Routing for MCDS Control */
    Ifx_CBS_TLCC TLCC[2];                   /**< \brief 40, TG Line Counter Control */
    unsigned char reserved_48[8];           /**< \brief 48, \internal Reserved */
    Ifx_CBS_TLCV TLCV[2];                   /**< \brief 50, TG Line Counter Value */
    unsigned char reserved_58[8];           /**< \brief 58, \internal Reserved */
    Ifx_CBS_TRSS TRSS;                      /**< \brief 60, TG Routing for Special Signals */
    Ifx_CBS_JTAGID JTAGID;                  /**< \brief 64, JTAG Device Identification Register */
    Ifx_CBS_COMDATA COMDATA;                /**< \brief 68, Communication Mode Data Register */
    Ifx_CBS_IOSR IOSR;                      /**< \brief 6C, IOClient Status and Control Register */
    Ifx_CBS_TLS TLS;                        /**< \brief 70, TG Line State */
    Ifx_CBS_TCTL TCTL;                      /**< \brief 74, TG Capture for TG Lines */
    Ifx_CBS_OEC OEC;                        /**< \brief 78, OCDS Enable Control Register */
    Ifx_CBS_OCNTRL OCNTRL;                  /**< \brief 7C, OSCU Control Register */
    Ifx_CBS_OSTATE OSTATE;                  /**< \brief 80, OSCU Status Register */
    Ifx_CBS_INTMOD INTMOD;                  /**< \brief 84, Internal Mode Status and Control Register */
    Ifx_CBS_ICTSA ICTSA;                    /**< \brief 88, Internally Controlled Trace Source Register */
    Ifx_CBS_ICTTA ICTTA;                    /**< \brief 8C, Internally Controlled Trace Destination Register */
    Ifx_CBS_TLC TLC;                        /**< \brief 90, TG Line Control */
    Ifx_CBS_TL1ST TL1ST;                    /**< \brief 94, TG Line 1 Suspend Targets */
    Ifx_CBS_TLCHE TLCHE;                    /**< \brief 98, TG Line Capture and Hold Enable */
    Ifx_CBS_TLCHS TLCHS;                    /**< \brief 9C, TG Line Capture and Hold Clear */
    Ifx_CBS_TRIGS TRIGS;                    /**< \brief A0, Set Trigger to Host Register */
    Ifx_CBS_TRIGC TRIGC;                    /**< \brief A4, Clear Trigger to Host Register */
    Ifx_CBS_TLT TLT;                        /**< \brief A8, TG Line Timer */
    Ifx_CBS_TLTTH TLTTH;                    /**< \brief AC, TG Lines for Trigger to Host */
    Ifx_CBS_TCCB TCCB;                      /**< \brief B0, TG Capture for Cores - BRKOUT */
    Ifx_CBS_TCCH TCCH;                      /**< \brief B4, TG Capture for Cores - HALT */
    Ifx_CBS_TCTGB TCTGB;                    /**< \brief B8, TG Capture for OTGB0/1 */
    Ifx_CBS_TCM TCM;                        /**< \brief BC, TG Capture for MCDS */
    Ifx_CBS_TREC TREC[3];                   /**< \brief C0, TG Routing Events of CPU */
    unsigned char reserved_CC[16];          /**< \brief CC, \internal Reserved */
    Ifx_CBS_TRMT TRMT;                      /**< \brief DC, TG Routing for MCDS Triggers */
    Ifx_CBS_TRTGB TRTGB[2];                 /**< \brief E0, TG Routing for OTGB */
    unsigned char reserved_F0[16];          /**< \brief F0, \internal Reserved */
    Ifx_CBS_TRIG TRIG[22];                  /**< \brief 100, Trigger to Host Register */
    unsigned char reserved_158[168];        /**< \brief 158, \internal Reserved */
} Ifx_CBS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCBS_REGDEF_H */
